Table of Contents
 Class ConcreteCheckResultBase
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
Concrete result base class
public abstract class ConcreteCheckResultBase
Inheritance
object
ConcreteCheckResultBase
Derived
ConcreteCheckDetailing
ConcreteSLSCheckResultCrackWidth
ConcreteSLSCheckResultStiffness
ConcreteSLSCheckResultStressLimitation
ConcreteULSCheckResultDiagramCapacity
ConcreteULSCheckResultFatigue
ConcreteULSCheckResultInteraction
ConcreteULSCheckResultResponse
ConcreteULSCheckResultShear
ConcreteULSCheckResultTorsion
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ConcreteCheckResultBase()
Constructor
protected ConcreteCheckResultBase()
Properties
 Check
settings of check type
public CalculationType Check { get; set; }
Property Value
CalculationType
 CheckValue
calculated limited value, calculated as strain to limit strain
public double CheckValue { get; set; }
Property Value
double
 InternalFores
internal forces used for calculation
public ResultOfInternalForces InternalFores { get; set; }
Property Value
ResultOfInternalForces
 LimitCheckValue
limit check value for result check
public double LimitCheckValue { get; set; }
Property Value
double
 NonConformities
Returns nonconformity in section
public List<NonConformity> NonConformities { get; set; }
Property Value
List<NonConformity>
 Result
check result passed/failed
public CheckResult Result { get; set; }
Property Value
CheckResult
 Edit this page